app/controllers/api/battery_shifts_controller.rb

INSERT INTO "battery_shifts" ("start_time", "end_time", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["start_time", "2019-11-03 20:00:00"], ["end_time", "2019-11-03 22:00:00"], ["employee_id", 1], ["created_at", "2019-11-04 01:39:25.070355"], ["updated_at", "2019-11-04 01:39:25.070355"]]
---
    def create
      battery_shift = BatteryShift.create!(battery_shift_params)

SELECT "battery_shifts".* FROM "battery_shifts" WHERE "battery_shifts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "vehicle_assignments".* FROM "vehicle_assignments" WHERE "vehicle_assignments"."battery_shift_id" = ?  [["battery_shift_id", 1]]
---
    def show
      battery_shift = BatteryShift.find(params[:id])
      # NB: this will return true if no vehicles have been assigned yet
      shift_status = battery_shift.vehicle_assignments.map(&:completed_at).all?