app/controllers/api/batteries_controller.rb

    def update
      vehicle = Vehicle.find(params[:vehicle_id])
      vehicle.update_attributes(battery_level: 1)
      assignment = VehicleAssignment.where(vehicle_id: vehicle.id, battery_shift_id: params[:battery_shift_id]).first
      assignment.update_attributes(completed_at: Time.now)
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "vehicles" SET "battery_level" = ?, "updated_at" = ? WHERE "vehicles"."id" = ?  [["battery_level", 1.0], ["updated_at", "2019-11-04 07:16:54.107827"], ["id", 84]]
SELECT "vehicle_assignments".* FROM "vehicle_assignments" WHERE "vehicle_assignments"."vehicle_id" = ? AND "vehicle_assignments"."battery_shift_id" = ? ORDER BY "vehicle_assignments"."id" ASC LIMIT ?  [["vehicle_id", 2], ["battery_shift_id", 2], ["LIMIT", 1]]
UPDATE "vehicle_assignments" SET "completed_at" = ?, "updated_at" = ? WHERE "vehicle_assignments"."id" = ?  [["completed_at", "2019-11-04 07:53:11.305300"], ["updated_at", "2019-11-04 07:53:11.560697"], ["id", 2]]