app/controllers/api/batteries_controller.rb

    def update
      vehicle = Vehicle.find(params[:vehicle_id])
      vehicle.update_attributes(battery_level: 1)
      assignment = VehicleAssignment.where(vehicle_id: vehicle.id, battery_shift_id: params[:battery_shift_id]).first
---
SELECT "vehicle_assignments".* FROM "vehicle_assignments" WHERE "vehicle_assignments"."vehicle_id" = ? AND "vehicle_assignments"."battery_shift_id" = ? LIMIT ?  [["vehicle_id", 1], ["battery_shift_id", 1], ["LIMIT", 11]]