app/controllers/api/vehicles_controller.rb

    def index
      battery_shift = BatteryShift.find(params[:battery_shift_id])
---
SELECT "battery_shifts".* FROM "battery_shifts" WHERE "battery_shifts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def show
      vehicle_status = VehicleAssignment.where(vehicle_id: params[:id], battery_shift_id: params[:battery_shift_id]).first
---
SELECT "vehicle_assignments".* FROM "vehicle_assignments" WHERE "vehicle_assignments"."vehicle_id" = ? AND "vehicle_assignments"."battery_shift_id" = ? ORDER BY "vehicle_assignments"."id" ASC LIMIT ?  [["vehicle_id", 69], ["battery_shift_id", 1], ["LIMIT", 1]]