app/controllers/api/vehicle_assignments_controller.rb

INSERT INTO "vehicle_assignments" ("battery_shift_id", "vehicle_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["battery_shift_id", 5], ["vehicle_id", 1], ["created_at", "2019-11-04 00:57:47.548683"], ["updated_at", "2019-11-04 00:57:47.548683"]]
---
    def create
      vehicle_assignment = VehicleAssignment.create!(vehicle_assignment_params)