app/models/battery_shift.rb

  def auto_assign_vehicles(lat, long)
    vehicles = Vehicle.near([lat, long], 5).limit(20)
    ordered_vehicles = [vehicles.shift]
    while !vehicles.empty?
---
SELECT vehicles.*, (69.09332411348201 * ABS(vehicles.location_lat - 40.64181327532475) * 0.7071067811865475) + (59.836573914187355 * ABS(vehicles.location_long - -73.98185534280718) * 0.7071067811865475) AS distance, CASE WHEN (vehicles.location_lat >= 40.64181327532475 AND vehicles.location_long >= -73.98185534280718) THEN  45.0 WHEN (vehicles.location_lat <  40.64181327532475 AND vehicles.location_long >= -73.98185534280718) THEN 135.0 WHEN (vehicles.location_lat <  40.64181327532475 AND vehicles.location_long <  -73.98185534280718) THEN 225.0 WHEN (vehicles.location_lat >= 40.64181327532475 AND vehicles.location_long <  -73.98185534280718) THEN 315.0 END AS bearing FROM "vehicles" WHERE (vehicles.location_lat BETWEEN 40.56944738376933 AND 40.71417916688017 AND vehicles.location_long BETWEEN -74.07722468324057 AND -73.88648600237379) ORDER BY distance ASC LIMIT ?  [["LIMIT", 20]]